app/mailers/user_mailer.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def welcome_email(user_id)
    @user = User.find(user_id)