app/controllers/book_reviews_controller.rb

  def index
    @book_reviews = BookReview.all
---
SELECT "book_reviews".* FROM "book_reviews"

  def show
    @book_review = BookReview.find(params[:id])
---
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def create
    @book_review = BookReview.new(book_review_params)

    if @book_review.save
---
INSERT INTO "bookreviews" ("book", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book", "Eloquent JavaScript: A Modern Introduction to Programming"], ["body", "This is a review."], ["created_at", "2021-08-27 14:32:55.950516"], ["updated_at", "2021-08-27 14:32:55.950516"]]

  def edit
    @book_review = BookReview.find(params[:id])
---
SELECT "bookreviews".* FROM "bookreviews" WHERE "bookreviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @book_review = BookReview.find(params[:id])

    if @book_review.update(book_review_params)
---
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "book_reviews" SET "body" = ?, "updated_at" = ? WHERE "book_reviews"."id" = ?  [["body", "This is a review on The Great Gatsby."], ["updated_at", "2021-09-03 10:54:44.950084"], ["id", 3]]

  def destroy
    @book_review = BookReview.find(params[:id])
    @book_review.destroy
---
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "book_reviews" WHERE "book_reviews"."id" = ?  [["id", 18]]