app/controllers/bookreviews_controller.rb

  def index
    @bookreviews = Bookreview.all
---
SELECT "bookreviews".* FROM "bookreviews"

  def show
    @bookreview = Bookreview.find(params[:id])
---
SELECT "bookreviews".* FROM "bookreviews" WHERE "bookreviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @bookreview = Bookreview.new(bookreview_params)

    if @bookreview.save
---
INSERT INTO "bookreviews" ("book", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book", "Artemis Fowl"], ["body", "This is also pretty good."], ["created_at", "2021-08-02 14:11:19.881595"], ["updated_at", "2021-08-02 14:11:19.881595"]]

  def edit
    @bookreview = Bookreview.find(params[:id])
---
SELECT "bookreviews".* FROM "bookreviews" WHERE "bookreviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @bookreview = Bookreview.find(params[:id])

    if @bookreview.update(bookreview_params)
---
SELECT "bookreviews".* FROM "bookreviews" WHERE "bookreviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bookreviews" SET "body" = ?, "updated_at" = ? WHERE "bookreviews"."id" = ?  [["body", "This is Dania's review"], ["updated_at", "2021-08-02 14:56:21.424111"], ["id", 5]]

  def destroy
    @bookreview = Bookreview.find(params[:id])
    @bookreview.destroy
---
SELECT "bookreviews".* FROM "bookreviews" WHERE "bookreviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bookreviews" WHERE "bookreviews"."id" = ?  [["id", 2]]